
let info = ()=> 100; 

/*
উপরের ()=> দিয়ে fat arrow function বুঝানো হলো।
আবার উপরের ফাংশনে শুধু ১টি স্টেটমেন্ট তাই এটি ১ লাইনে লিখা হলো।
এবং এটি 100 কে রিটার্ন করবে তাই return keyword টি বাদ দিয়ে 
লিখা হলো কারন ১ লাইনে কোড টা সংক্ষিপ্ত করার পর যদি return keyword টি  বাদ না দেওয়া হয় 
প্রোগ্রামটি কাজ করবে না।
*/
console.log(info());


let view = (n)=> n;
// উপরে একটি প্যারামিটার দিয়ে উদাহরন দেয়া হলো
console.log(view(15));




let view2 = n=> n;
// উপরে একটি প্যারামিটার থাকলে কিভাবে () বাদ দিয়েও লেখা যায় তা দেখানো হলো
console.log(view2(15));



let view3 = (n,m)=> n + m;
// উপরে একটির বেশি প্যারামিটার থাকলে যে অবশ্যই () দিয়ে লিখতে হয় তা দেখানো হলো
console.log(view3(20,36));

let view4 = (n,m=20)=> n + m;
// উপরে default parameter থাকলে যে ফাংশন কল করার সময় default parameter এর ভ্যালু পাস না করলেও হয় তা দেখানো হলো
console.log(view4(20));